load-test.yml
config:
  target: "http://localhost:3000"  # Replace with your app's URL
  phases:
    - duration: 60    # Test duration in seconds
      arrivalRate: 10  # Number of users to start per second
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 10
      arrivalCount: 50 # Total users to maintain
      name: "Sustained load"
  payload:
    path: "users.csv"  # File with test data (optional)
    fields:
      - "email"
      - "password"
  plugins:
    ensure: {}  # For assertions
    apdex: {}   # For performance metrics

scenarios:
  - name: "Pet Owner Workflow"
    flow:
      # 1. User Login
      - post:
          url: "/api/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            json: "$.token"
            as: "authToken"
          ensure:
            status: 200
    
      # 2. Get User Dashboard
      - get:
          url: "/api/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ensure:
            status: 200
    
      # 3. View Pets
      - get:
          url: "/api/pets"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ensure:
            status: 200
    
      # 4. Add a New Task
      - post:
          url: "/api/tasks"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            pet_id: 1
            task_type: "feeding"
            due_date: "2025-04-15 08:00:00"
          ensure:
            status: 201
    
      # 5. View Community Posts
      - get:
          url: "/api/community/posts"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ensure:
            status: 200